#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.frontend.aws_kms_key.mykey: Refreshing state... [id=f1c85d82-243d-45fe-bfe6-5a2fdd6bf44e]
module.frontend.aws_wafv2_web_acl.waf_acl: Refreshing state... [id=4e60e6b0-61a3-4a70-9a60-4a252f3e7c7c]
module.frontend.aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E2KG39NGUA7DI2]
module.frontend.aws_acm_certificate.ssl: Refreshing state... [id=arn:aws:acm:us-east-1:529080338478:certificate/3f355d4e-762e-4305-a1de-b04e42a54abd]
module.frontend.aws_s3_bucket.bucket: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_route53_record.example["video.rayprogramming.com"]: Refreshing state... [id=Z1M325FGK1MICN__03818f016c5687757483524eb672ebaa.video.rayprogramming.com._CNAME]
module.frontend.aws_route53_record.example["www.video.rayprogramming.com"]: Refreshing state... [id=Z1M325FGK1MICN__cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com._CNAME]
module.frontend.aws_acm_certificate_validation.ssl: Refreshing state... [id=2022-01-23 21:54:35.297 +0000 UTC]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2QZVOHCSCH69J]
module.frontend.aws_route53_record.subdomain_root: Refreshing state... [id=Z1M325FGK1MICN_video_A]
module.frontend.aws_route53_record.subdomain_www[0]: Refreshing state... [id=Z1M325FGK1MICN_www.video_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.frontend.aws_cloudfront_distribution.s3_distribution has changed
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
      ~ etag                           = "E16BENFGULID4A" -> "E3BFBTD2QY2YV6"
        id                             = "E2QZVOHCSCH69J"
      ~ last_modified_time             = "2022-01-23 21:54:40.337 +0000 UTC" -> "2022-01-24 01:04:51.18 +0000 UTC"
        tags                           = {
            "Environment" = "video.rayprogramming.com"
        }
        # (18 unchanged attributes hidden)


      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "video.rayprogramming.com.s3.us-east-2.amazonaws.com"
          + origin_id           = "S3-video.rayprogramming.com"

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E2KG39NGUA7DI2"
            }
        }
      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "video.rayprogramming.com.s3.us-east-2.amazonaws.com" -> null
          - origin_id           = "S3-video.rayprogramming.com" -> null
        }


        # (3 unchanged blocks hidden)
    }

  # module.frontend.aws_kms_key.mykey has changed
  ~ resource "aws_kms_key" "mykey" {
        id                                 = "f1c85d82-243d-45fe-bfe6-5a2fdd6bf44e"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::529080338478:root" -> [
                              + "arn:aws:sts::529080338478:assumed-role/video_plan/gh",
                              + "arn:aws:iam::529080338478:root",
                            ]
                        }
                        # (4 unchanged elements hidden)
                    },
                ]
                # (2 unchanged elements hidden)
            }
        )
      + tags                               = {}
        # (11 unchanged attributes hidden)
    }

  # module.frontend.aws_s3_bucket.bucket has changed
  ~ resource "aws_s3_bucket" "bucket" {
      + arn                         = "arn:aws:s3:::video.rayprogramming.com"
      + bucket_domain_name          = "video.rayprogramming.com.s3.amazonaws.com"
      + bucket_regional_domain_name = "video.rayprogramming.com.s3.us-east-2.amazonaws.com"
      + hosted_zone_id              = "Z2O1EMRO9K5GLX"
        id                          = "video.rayprogramming.com"
      ~ policy                      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2QZVOHCSCH69J" -> "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2KG39NGUA7DI2"
                        }
                        # (4 unchanged elements hidden)
                    },
                ]
                # (2 unchanged elements hidden)
            }
        )
      + region                      = "us-east-2"
      + request_payer               = "BucketOwner"
      + tags                        = {}
      + tags_all                    = {}
        # (3 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn:aws:kms:us-east-2:529080338478:key/f1c85d82-243d-45fe-bfe6-5a2fdd6bf44e" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      ~ versioning {
          ~ enabled    = true -> false
            # (1 unchanged attribute hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.frontend.aws_s3_bucket.bucket is tainted, so must be replaced
-/+ resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::video.rayprogramming.com" -> (known after apply)
      ~ bucket_domain_name          = "video.rayprogramming.com.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "video.rayprogramming.com.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "video.rayprogramming.com" -> (known after apply)
      ~ policy                      = jsonencode( # whitespace changes
            {
                Id        = "PolicyForCloudFrontPrivateContent"
                Statement = [
                    {
                        Action    = "s3:GetObject"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2KG39NGUA7DI2"
                        }
                        Resource  = "arn:aws:s3:::video.rayprogramming.com/*"
                        Sid       = "1"
                    },
                ]
                Version   = "2008-10-17"
            }
        )
      ~ region                      = "us-east-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = "arn:aws:kms:us-east-2:529080338478:key/f1c85d82-243d-45fe-bfe6-5a2fdd6bf44e"
                  + sse_algorithm     = "aws:kms"
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> true
            # (1 unchanged attribute hidden)
        }
    }

  # module.frontend.aws_s3_bucket_object.index will be created
  + resource "aws_s3_bucket_object" "index" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_bucket_public_access_block.bucket_pab will be created
  + resource "aws_s3_bucket_public_access_block" "bucket_pab" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Rihoj, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*